{"keras_version": "2.1.1", "config": [{"config": {"kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 5], "use_bias": true, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "dtype": "float32", "units": 5, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "linear", "units": 100, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "linear", "units": 10, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}